CreatorKanata/terra-guard-ai-digikey-make-one-2026/src/FRDM-MCXN947/terra-guard-ai/frdmmcxn947_cm33_core0/led_blinky/pin_mux.h
/*
 * Copyright 2022-2023 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*!
 * @brief オンボード温度センサ P3T1755DP 用の I3C1 ピンを設定する。
 */
void BOARD_InitI3CPins(void);

/*!
 * @brief 外部I²Cセンサ（MLX90640 等）用の LPI2C2/FLEXCOMM2 ピン(P4_0/P4_1)を設定する。
 */
void BOARD_InitI2CPins(void);

/*!
 * @brief ステータス表示用LED（P1_22 = GPIO1[22], J3 pin3）の GPIO ピンを設定する。
 */
void BOARD_InitStatusLedPin(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
